Following is the console log when I run `airy create --provider=minikube my-airy`

```
📁 Initialized Airy workspace directory at /Users/shubhamsingh/Documents/projects/rasa_iters/rasa_airy/my-airy
📁 Set up installation directory in the Airy workspace at /Users/shubhamsingh/Documents/projects/rasa_iters/rasa_airy/my-airy/terraform
⚙️  Creating core with provider minikube
#	
#	minikube provider output:
#	
#	Install airy-core on provider minikube [y/n]?y#	
#	Initializing modules...
#	Downloading git::https://github.com/airyhq/airy.git for minikube...
#	- minikube in .terraform/modules/minikube/infrastructure/terraform/modules/minikube
#	
Initializing the backend...
#	
Successfully configured the backend "local"! Terraform will automatically
use this backend unless the backend configuration changes.
#	
Initializing provider plugins...
#	- Finding latest version of hashicorp/null...
#	- Installing hashicorp/null v3.2.1...
#	- Installed hashicorp/null v3.2.1 (signed by HashiCorp)
#	
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.
#	
#	Terraform has been successfully initialized!
#	
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
#	
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

#	  # module.minikube.null_resource.minikube will be created
  + resource "null_resource" "minikube" {
      + id       = (known after apply)
      + triggers = {
          + "cpus"                   = "3"
          + "driver"                 = "docker"
          + "kubeconfig_output_path" = "../kube.conf"
          + "memory"                 = "7168"
          + "nodeport"               = "80"
          + "profile"                = "airy-core"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
#	
Changes to Outputs:
  + kubeconfig_path = "../kube.conf"
#	module.minikube.null_resource.minikube: Creating...
#	module.minikube.null_resource.minikube: Provisioning with 'local-exec'...
#	module.minikube.null_resource.minikube (local-exec): Executing: ["/bin/sh" "-c" "KUBECONFIG=../kube.conf minikube -p airy-core start --driver=docker --cpus=3 --memory=7168 --container-runtime=containerd --ports=80:80 --extra-config=apiserver.service-node-port-range=1-65535"]
#	module.minikube.null_resource.minikube (local-exec): * [airy-core] minikube v1.28.0 on Darwin 13.0.1 (arm64)
#	module.minikube.null_resource.minikube (local-exec):   - KUBECONFIG=../kube.conf
#	module.minikube.null_resource.minikube (local-exec): * Using the docker driver based on user configuration
#	module.minikube.null_resource.minikube (local-exec): * Using Docker Desktop driver with root privileges
#	module.minikube.null_resource.minikube (local-exec): * Starting control plane node airy-core in cluster airy-core
#	module.minikube.null_resource.minikube (local-exec): * Pulling base image ...
#	module.minikube.null_resource.minikube (local-exec): * Creating docker container (CPUs=3, Memory=7168MB) ...
#	module.minikube.null_resource.minikube: Still creating... [10s elapsed]
#	module.minikube.null_resource.minikube: Still creating... [20s elapsed]
#	module.minikube.null_resource.minikube: Still creating... [30s elapsed]
#	module.minikube.null_resource.minikube (local-exec): * Preparing Kubernetes v1.25.3 on containerd 1.6.9 ...
#	module.minikube.null_resource.minikube (local-exec):   - apiserver.service-node-port-range=1-65535
#	module.minikube.null_resource.minikube (local-exec):   - Generating certificates and keys ...
#	module.minikube.null_resource.minikube (local-exec):   - Booting up control plane ...
#	module.minikube.null_resource.minikube (local-exec):   - Configuring RBAC rules ...
#	module.minikube.null_resource.minikube (local-exec): * Configuring CNI (Container Networking Interface) ...
#	module.minikube.null_resource.minikube: Still creating... [40s elapsed]
#	module.minikube.null_resource.minikube (local-exec): * Verifying Kubernetes components...
#	module.minikube.null_resource.minikube (local-exec):   - Using image gcr.io/k8s-minikube/storage-provisioner:v5
#	module.minikube.null_resource.minikube (local-exec): * Enabled addons: storage-provisioner, default-storageclass
#	module.minikube.null_resource.minikube (local-exec): * Done! kubectl is now configured to use "airy-core" cluster and "default" namespace by default
#	module.minikube.null_resource.minikube: Creation complete after 41s [id=7113124559416634042]
#	
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

kubeconfig_path = "../kube.conf"
#	Initializing modules...
#	Downloading git::https://github.com/airyhq/airy.git for airy_core...
#	- airy_core in .terraform/modules/airy_core/infrastructure/terraform/modules/core
#	
Initializing the backend...
#	
Successfully configured the backend "local"! Terraform will automatically
use this backend unless the backend configuration changes.
#	
Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding latest version of hashicorp/http...
#	- Finding latest version of hashicorp/local...
#	- Finding latest version of hashicorp/helm...
#	- Finding latest version of hashicorp/kubernetes...
#	- Installing hashicorp/http v3.2.1...
#	- Installed hashicorp/http v3.2.1 (signed by HashiCorp)
#	- Installing hashicorp/local v2.2.3...
#	- Installed hashicorp/local v2.2.3 (signed by HashiCorp)
#	- Installing hashicorp/helm v2.7.1...
#	- Installed hashicorp/helm v2.7.1 (signed by HashiCorp)
#	- Installing hashicorp/kubernetes v2.16.0...
#	- Installed hashicorp/kubernetes v2.16.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.
#	
Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
#	data.terraform_remote_state.kubernetes: Reading...
#	module.airy_core.data.http.core_version: Reading...
#	data.terraform_remote_state.kubernetes: Read complete after 0s
#	module.airy_core.data.http.core_version: Read complete after 0s [id=https://raw.githubusercontent.com/airyhq/airy/main/VERSION]
#	
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

#	  # local_file.cli_yaml will be created
  + resource "local_file" "cli_yaml" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../cli.yaml"
      + id                   = (known after apply)
    }

#	  # module.airy_core.data.kubernetes_config_map.core_config will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_config_map" "core_config" {
      + binary_data = (known after apply)
      + data        = (known after apply)
      + id          = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "core-config"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

#	  # module.airy_core.data.kubernetes_service.ingress will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "ingress" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress-nginx-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

#	  # module.airy_core.helm_release.airy_core will be created
  + resource "helm_release" "airy_core" {
      + atomic                     = false
      + chart                      = "https://helm.airy.co/charts/airy-0.52.0.tgz"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "airy-release"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                
                global:
                  host: localhost
                ingress-controller:
                  ngrokEnabled: true
            EOT,
          + <<-EOT
                prerequisites:
                  kafka:
                    kafka:
                      resources:
                        requests:
                          cpu: "300m"  
                          memory: "512Mi"
                        limits:
                          cpu: "2000m"
                          memory: "4096Mi"
                    zookeeper:
                      resources:
                        requests:
                          cpu: "100m"  
                          memory: "128Mi"
                        limits:
                          cpu: "1000m"
                          memory: "2048Mi"
                components:
                  api:
                    admin:
                      resources:
                        requests:
                          cpu: "100m"  
                          memory: "128Mi"
                        limits:
                          cpu: "1000m"
                          memory: "1024Mi"
                    communication:
                      communication:
                        resources:
                          requests:
                            cpu: "200m"  
                            memory: "128Mi"
                          limits:
                            cpu: "2000m"
                            memory: "2048Mi"
                      websocket:
                        resources:
                          requests:
                            cpu: "50m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                  frontend:
                    ui:
                      resources:
                        requests:
                          cpu: "50m"  
                          memory: "64Mi"
                        limits:
                          cpu: "500m"
                          memory: "512Mi"
                  integration:
                    source-api:
                      resources:
                        requests:
                          cpu: "50m"
                          memory: "128Mi"
                        limits:
                          cpu: "1000m"
                          memory: "1024Mi"
                    webhook:
                      consumer:
                        resources:
                          requests:
                            cpu: "50m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                      publisher:
                        resources:
                          requests:
                            cpu: "50m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "2048Mi"
                  media:
                    resolver:
                      resources:
                        requests:
                          cpu: "50m"
                          memory: "128Mi"
                        limits:
                          cpu: "1000m"
                          memory: "1024Mi"
                  sources:
                    chatplugin:
                      backend:
                        resources:
                          requests:
                            cpu: "50m"  
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                      frontend:
                        resources:
                          requests:
                            cpu: "50m"  
                            memory: "64Mi"
                          limits:
                            cpu: "500m"
                            memory: "1024Mi"
                    facebook:
                      connector:
                        resources:
                          requests:
                            cpu: "100m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                      eventsRouter:
                        resources:
                          requests:
                            cpu: "50m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                    google:
                      connector:
                        resources:
                          requests:
                            cpu: "100m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                      eventsRouter:
                        resources:
                          requests:
                            cpu: "50m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                    twilio:
                      connector:
                        resources:
                          requests:
                            cpu: "100m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                      eventsRouter:
                        resources:
                          requests:
                            cpu: "50m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                    viber:
                      connector:
                        resources:
                          requests:
                            cpu: "100m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
                      eventsRouter:
                        resources:
                          requests:
                            cpu: "50m"
                            memory: "128Mi"
                          limits:
                            cpu: "1000m"
                            memory: "1024Mi"
            EOT,
          + "",
        ]
      + verify                     = false
      + version                    = "0.52.0"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "global.appImageTag"
          + value = "0.52.0"
        }
      + set {
          + name  = "ingress-controller.enabled"
          + value = "true"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
#	
Changes to Outputs:
  + API   = (known after apply)
  + Info  = "For more information visit https://airy.co/docs/core/getting-started/installation/introduction"
  + NGROK = (known after apply)
#	module.airy_core.helm_release.airy_core: Creating...
#	module.airy_core.helm_release.airy_core: Still creating... [10s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [20s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [30s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [40s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [50s elapsed]
#      module.airy_core.helm_release.airy_core: Still creating... [1m0s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [1m10s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [1m20s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [1m30s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [1m40s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [1m50s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [2m0s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [2m10s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [2m20s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [2m30s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [2m40s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [2m50s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [3m0s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [3m10s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [3m20s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [3m30s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [3m40s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [3m50s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [4m0s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [4m10s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [4m20s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [4m30s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [4m40s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [4m50s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [5m0s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [5m10s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [5m20s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [5m30s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [5m40s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [5m50s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [6m0s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [6m10s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [6m20s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [6m30s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [6m40s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [6m50s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [7m0s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [7m10s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [7m20s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [7m30s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [7m40s elapsed]
#	module.airy_core.helm_release.airy_core: Still creating... [7m50s elapsed]
.
.
.
.
.
.
.
.
.

```
The docker desktop resources are as follows:
`CPUs: 4`
`Memory: 10 GB`
`Swap: 1 GB`
`Disk Image Size: 120 GB`